Grooming/src/Documents/РасходДенежныхСредств/РасходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенежныхСредств</name>
  <basedOn>Document.ПоступлениеУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровИМатериалов</basedOn>
  <basedOn>Document.РеализацияТоваровИУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходаДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИМатериалов</types>
      <types>DocumentRef.ПоступлениеУслуг</types>
      <types>DocumentRef.РеализацияТоваровИУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Grooming/src/Enums/ВидыОперацийРасходаДенег/ВидыОперацийРасходаДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходаДенег</name>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенегПодотчетнику</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Клиент</name>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиПолученияИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Питомцы</name>
    <attributes>
      <name>ВидПитомца</name>
      <type>
        <types>EnumRef.ВидыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаПитомца</name>
      <type>
        <types>CatalogRef.ПородыПитомцев</types>
      </type>
    </attributes>
    <attributes>
      <name>КличкаПитомца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРожденияПитомца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Grooming/src/Documents/РасходДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	Получатель = Объект.Получатель;
	ВидОперации = Объект.ВидОперации;
		
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры 



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиентеПроцедура УстановитьВидимость()		СтрокаТипПолучателя = "";		Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаДенегПодотчетнику") Тогда		Элементы.ДоговорКонтрагента.Видимость = Ложь;		Элементы.Получатель.Видимость = Истина;		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВзносНаличнымиВБанк") Тогда		Элементы.ДоговорКонтрагента.Видимость = Ложь;		Элементы.Получатель.Видимость = Истина;		СтрокаТипПолучателя = "СправочникСсылка.Банки";	ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику")		ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратДенегПокупателю") Тогда		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты"; 
		Элементы.ДоговорКонтрагента.Видимость = Истина;	Иначе		Элементы.ДоговорКонтрагента.Видимость = Истина;		Элементы.Получатель.Видимость = Истина;	КонецЕсли;	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда		Массив = Новый Массив();		Массив.Добавить(Тип(СтрокаТипПолучателя));				ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;	КонецЕсли;		Если Элементы.ДоговорКонтрагента.Видимость = Истина		И ЗначениеЗаполнено(Объект.Получатель) Тогда		Элементы.ДоговорКонтрагента.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);	КонецЕсли;КонецПроцедуры     

&НаСервереБезКонтекстаФункция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Получатель)	Запрос = Новый Запрос;	Запрос.УстановитьПараметр("Получатель", Получатель);	Запрос.Текст = "ВЫБРАТЬ	|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,	|    Контрагенты.Ссылка КАК Контрагент	|ИЗ	|    Справочник.Контрагенты КАК Контрагенты	|ГДЕ	|    Контрагенты.Ссылка = &Получатель";		Выборка = Запрос.Выполнить().Выбрать();	Выборка.Следующий();		Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)		И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда		возврат Ложь;	Иначе		возврат Истина;	КонецЕсли;
КонецФункции  


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;	Если  ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");		МассивОчищаемыхРеквизитов.Добавить("Получатель");				ТекстВопроса = "При изменении реквизита ""ВидОперации"" будут очищены следующие данные:		| - Договор		| - Получатель		| Продолжить?";			ИначеЕсли (Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаДенегПодотчетнику")		ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВзносНаличнымиВБанк") )		И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");				ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:		| - Договор		| Продолжить?";			КонецЕсли;		Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");	Иначе		ВидОперации =  Объект.ВидОперации;		УстановитьВидимость();	КонецЕсли;
КонецПроцедуры  

&НаКлиентеПроцедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт	Если Результат = КодВозвратаДиалога.Да Тогда		Для Каждого Реквизит Из ДополнительныеПараметры Цикл			Объект[Реквизит] = Неопределено;		КонецЦикла;		УстановитьВидимость();		ВидОперации =  Объект.ВидОперации;	Иначе		Объект.ВидОперации = ВидОперации;	КонецЕсли;КонецПроцедуры


&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ЭтоПоставщик = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);	МассивОчищаемыхРеквизитов = Новый Массив;		Если НЕ ЭтоПоставщик И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");				ТекстВопроса = "При изменении реквизита ""Получатель"" будут очищены следующие данные:		| - Договор		| Продолжить?";	КонецЕсли;		Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПолучатель", ЭтаФорма, МассивОчищаемыхРеквизитов);		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");	Иначе		Получатель =  Объект.Получатель;		УстановитьВидимость();	КонецЕсли;
КонецПроцедуры  

&НаКлиентеПроцедура ПослеОтветаНаВопросОбИзмененииПолучатель(Результат, ДополнительныеПараметры) Экспорт		Если Результат = КодВозвратаДиалога.Да Тогда		Для Каждого Реквизит Из ДополнительныеПараметры Цикл			Объект[Реквизит] = Неопределено;		КонецЦикла;		УстановитьВидимость();		Получатель =  Объект.Получатель;	Иначе		Объект.Получатель = Получатель;	КонецЕсли;КонецПроцедуры
